{
  "data": [
    {
      "url": "https://bitcoinist.com/shiba-inu-major-exchange-listing/",
      "title": "Shiba Inu Scores Major Exchange Listing Amid Surging Adoption",
      "description": "The Shiba Inu ecosystem has recorded yet another noteworthy milestone with its recent listing on a leading cryptocurrency and digital asset platform. This latest development comes at a time when interest and demand for SHIB have been growing rapidly, further increasing the prospects for an adoption boost in the cryptocurrency.   Shiba Inu Gets Listed On [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2024/04/Shiba-inu-2.webp?fit=640%2C335",
      "createdAt": "Sat, 06 Apr 2024 11:00:39 +0000"
    },
    {
      "url": "https://bitcoinist.com/crypto-sleuth-accuses-authorities-of-harassment/",
      "title": "Crypto Investigator Accuses US Law Enforcement Of &#8216;Harassment&#8217;",
      "description": "Scams and hacks have been some of the most significant issues affecting the crypto industry over the past few years. As a result, the space has seen the birth of several blockchain investigators striving to ensure the digital asset space is safe for everyone to go about their business with ease and confidence. ZachXBT, one [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2023/07/iStock-962366210.jpg?fit=629%2C420",
      "createdAt": "Sat, 06 Apr 2024 08:00:28 +0000"
    },
    {
      "url": "https://bitcoinist.com/us-jury-deems-do-kwon-terraform-liable-for-fraud/",
      "title": "US Jury Finds Do Kwon, Terraform Labs Liable For Fraud In SEC Trial",
      "description": "According to a Friday report by Bloomberg, a  United States jury found Terraform Labs and its co-founder Do Kwon liable for civil fraud over the crash of the Terra ecosystem in 2022. This development comes as Do Kwon continues to battle criminal cases in the US and South Korea over the sudden collapse of the [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2024/03/NJ2KMWQD45N33D3CE6BRNO5O7M.jpg?fit=630%2C420",
      "createdAt": "Sat, 06 Apr 2024 05:45:43 +0000"
    },
    {
      "url": "https://bitcoinist.com/blackrock-bitcoin-etf-broadens-reach/",
      "title": "BlackRock&#8217;s Bitcoin ETF Broadens Reach, Securing 5 New Wall Street Banking Giants As APs",
      "description": "In recent times, the increasing appeal of Bitcoin (BTC) among asset managers and traditional finance (TradFi) institutions has gained significant attention, particularly with the notable success of Bitcoin ETF products offered by industry leaders like BlackRock, Grayscale, and Fidelity.  This success has prompted more Wall Street banking institutions to eagerly enter the newly approved ETF [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2024/04/shutterstock_download-7-9.jpg?fit=463%2C260",
      "createdAt": "Sat, 06 Apr 2024 02:30:12 +0000"
    },
    {
      "url": "https://bitcoinist.com/ethereums-reputation-takes-a-hit-as-trading-veteran/",
      "title": "Ethereum&#8217;s Reputation Takes A Hit? Trading Veteran Labels It A &#8216;Junk&#8217; Coin",
      "description": "Recently, renowned trader Peter Brandt voiced criticism directed squarely at Ethereum (ETH), the second-largest crypto by market capitalization, denouncing it as a &#8220;junk coin&#8221; in a blunt assessment. Ethereum Faces Criticism Celebrated for his insights into financial markets, Peter Brandt spared no punches as he castigated Ethereum, arguing that it lacks the essential characteristics required [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2023/12/Ethereum-Bullish-Outlook.jpg?fit=630%2C420",
      "createdAt": "Sat, 06 Apr 2024 01:00:38 +0000"
    },
    {
      "url": "https://bitcoinist.com/cardano-war-chest-growing-why-is-ada-dropping/",
      "title": "Cardano War Chest Growing: Why Is ADA Dropping?",
      "description": "On-chain data on April 5 shows that the Cardano Treasury is rapidly growing even as ADA prices struggle to shake off determined sellers. Currently, the treasury holds over 1.48 billion ADA worth over $843 million at spot rates. If adoption projections are anything to go by, the figure could exponentially increase in the coming months, possibly propping [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2024/04/Crypto-news-Template229.jpg?fit=640%2C362",
      "createdAt": "Fri, 05 Apr 2024 23:30:51 +0000"
    },
    {
      "url": "https://bitcoinist.com/dogecoin-mvrv-ratio-negative/",
      "title": "Dogecoin MVRV Ratio Turns Negative &#8211; Here’s What It Means For DOGE’s Price",
      "description": "Dogecoin has been stuck in a price correction since March 31, falling by 21% from $0.2214. This has seen DOGE falling across a number of metrics, including the MVRV ratio. The MVRV ratio recently turned negative, a condition that indicates many holders are currently at a loss. This might sound bad, but it could actually [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2024/04/Dogecoin-price.jpeg?fit=640%2C360",
      "createdAt": "Fri, 05 Apr 2024 22:00:54 +0000"
    },
    {
      "url": "https://bitcoinist.com/sony-bank-leverages-polygon-blockchain-stablecoin/",
      "title": "Sony Bank Leverages Polygon Blockchain For Stablecoin Pilot Program",
      "description": "According to local media reports in Japan, Sony Bank announced its foray into the stablecoin world, launching a trial to issue its fiat-linked digital currency. In collaboration with blockchain company SettleMint, one of the most notable aspects of the pilot program is that the trial will take place on the Polygon blockchain. Sony Bank&#8217;s Strategic [&#8230;]",
      "thumbnail": "https://bitcoinist.com/wp-content/uploads/2024/04/shutterstock_download-7-8.jpg?fit=513%2C260",
      "createdAt": "Fri, 05 Apr 2024 20:30:13 +0000"
    }
  ]
}
